IDEA Open Model
ThermalStrainState Enumeration
Compatible with IDEA StatiCa 20.1
 Type of curvature - thermal strain curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum ThermalStrainState
Public Enumeration ThermalStrainState
Members
Member name | Value | Description
None | 0 |  The curvature is not defined
Code | 1 |  The curvatire is defined by the code
User | 5 |  The curvature is input by the user
See Also
Reference
IdeaRS.OpenModel.Material Namespace